src/Documents/КорректировкаПеремещенияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>КорректировкаПеремещенияТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.РазмещенияСтрокЗаказов</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВПути</xr:Item>
				<xr:Item>AccumulationRegister.РезервыТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПеремещениеТоваров</Name>
			<Comment>(Общ)</Comment>
			<BasedOn>
				<xr:Item>Document.ВнутреннийЗаказ</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПартииТоваровVMI</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровВПути</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ОтказыПоЗаявкам</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКРезервированию</xr:Item>
				<xr:Item>AccumulationRegister.ПополнениеСклада</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВПути</xr:Item>
				<xr:Item>AccumulationRegister.РезервыТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПеремещенияТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФилиалОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФилиалПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>если реквизит заполнен - значит идет приемка из ТопЛог</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмещениеСсылкаТопЛог</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгруженВТопЛог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновленИзТопЛог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженИзТопЛог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданВ77</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>флНеВыгружатьВТопЛог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поступление</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНеПринято</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Качество</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Качество</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПрихода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокПриходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаЗаявки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокЗаявок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПлан</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/КорректировкаПеремещенияТоваров/Ext/ManagerModule.bsl
Функция ПолучитьПартииТоваровУпр(вхСсылкаНаДокумент)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&ВидДвижения,
	|	&вхСсылка КАК Регистратор,
	|	&вхДата КАК Период,
	|	&Склад,
	|	ПартииТоваровУпр.ЕдиницаИзмерения,
	|	ПартииТоваровУпр.СтрокаПрихода,
	|	ПартииТоваровУпр.Количество
	|ИЗ
	|	РегистрНакопления.ПартииТоваровУпр КАК ПартииТоваровУпр
	|ГДЕ
	|	ПартииТоваровУпр.Регистратор = &Ссылка";
	
	вхДокументОснование = ОбщегоНазначения.ПолучитьЗначениеРеквизита(вхСсылкаНаДокумент, "ДокументОснование");
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("вхСсылка", вхСсылкаНаДокумент);
	Запрос.УстановитьПараметр("вхДата", ОбщегоНазначения.ПолучитьЗначениеРеквизита(вхСсылкаНаДокумент, "Дата"));
	Запрос.УстановитьПараметр("Склад", ОбщегоНазначения.ПолучитьЗначениеРеквизита(вхДокументОснование, "СкладПолучатель"));
	Запрос.УстановитьПараметр("Ссылка", вхДокументОснование);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
//--------------------------------------------------------
Функция РегистрыНакопления_ТоварыНаСкладах(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено) Экспорт
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(вхСсылкаНаДокумент, "Дата") < ПараметрыСеанса.ДатаНачалаРаботыТовары Тогда
		ТаблицаДвижений = Неопределено;
		ОбщегоНазначения.СоздатьСтруктуруРегистраНакопления("ТоварыНаСкладах", ТаблицаДвижений);
		Возврат ТаблицаДвижений
	КонецЕсли;
	
	вхПериод = вхСсылкаНаДокумент.МоментВремени();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&ВидДвижения,
	|	ПеремещениеТоваров.Ссылка КАК Регистратор,
	|	&Дата КАК Период,
	|	ПеремещениеТоваров.Номенклатура,
	|	ПеремещениеТоваров.Ссылка.СкладПолучатель КАК Склад,
	|	ПеремещениеТоваров.Ссылка.СкладОтправитель КАК СкладОтправитель,
	|	ПеремещениеТоваров.Ссылка.СкладПолучатель КАК СкладПолучатель,
	|	ПеремещениеТоваров.Качество,
	|	ПеремещениеТоваров.Количество - ПеремещениеТоваров.КоличествоНеПринято КАК Количество,
	|	ПеремещениеТоваров.СтрокаПрихода КАК СтрокаПрихода
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.Ссылка = &Ссылка
	|	И ПеремещениеТоваров.Количество - ПеремещениеТоваров.КоличествоНеПринято > 0";
		
	Запрос.УстановитьПараметр("Ссылка", ОбщегоНазначения.ПолучитьЗначениеРеквизита(вхСсылкаНаДокумент, "ДокументОснование"));
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("Дата", вхПериод.Дата);
				
	ТабТоваров = Запрос.Выполнить().Выгрузить();
	
	ПроведениеДокументовКлиентСервер.ЗаписатьЗначение(вхПараметры, "ТаблицаТоваров", ТабТоваров);
	
	Возврат ТабТоваров;

КонецФункции

Функция РегистрыНакопления_ПартииТоваровУпр(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено)
	ТабТоваров = Новый ТаблицаЗначений;
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(вхСсылкаНаДокумент, "Дата") < ПараметрыСеанса.ДатаНачалаРаботыТовары Тогда
		ТаблицаДвижений = Неопределено;
		ОбщегоНазначения.СоздатьСтруктуруРегистраНакопления("ПартииТоваровУпр", ТаблицаДвижений);
		Возврат ТаблицаДвижений
	КонецЕсли;
	
	Если НЕ ПроведениеДокументовКлиентСервер.ПрочитатьЗначение(вхПараметры, "ТаблицаТоваров", ТабТоваров) Тогда
		ТабТоваров = РегистрыНакопления_ТоварыНаСкладах(вхСсылкаНаДокумент, вхОтказ);
	КонецЕсли;
	
	Возврат ТабТоваров;
	
	//ТабПартийУпр = Новый ТаблицаЗначений;
	//ОбщегоНазначения.СоздатьСтруктуруРегистраНакопления("ПартииТоваровУпр", ТабПартийУпр);
	//
	//Для Каждого Товар Из ТабТоваров Цикл
	//	Если ЗначениеЗаполнено(Товар.СтрокаПрихода) Тогда
	//		нс = ТабПартийУпр.Добавить();
	//		нс.ВидДвижения = Товар.ВидДвижения;
	//		нс.Период = Товар.Период;
	//		нс.Регистратор = Товар.Регистратор;
	//		нс.Склад = Товар.Склад;
	//		нс.ЕдиницаИзмерения = Товар.ЕдиницаИзмерения;
	//		нс.СтрокаПрихода = Товар.СтрокаПрихода;
	//		нс.Количество = Товар.Количество;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Если ТабПартийУпр.Количество() = 0 Тогда
	//	ТабПартийУпр = ПолучитьПартииТоваровУпр(вхСсылкаНаДокумент);
	//	
	//КонецЕсли;
	
КонецФункции

Функция РегистрыНакопления_ТоварыПеремещения(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено)
	ТабТоваров = Новый ТаблицаЗначений;
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(вхСсылкаНаДокумент, "Дата") < ПараметрыСеанса.ДатаНачалаРаботыТовары Тогда
		ТаблицаДвижений = Неопределено;
		ОбщегоНазначения.СоздатьСтруктуруРегистраНакопления("ТоварыПеремещения", ТаблицаДвижений);
		Возврат ТаблицаДвижений
	КонецЕсли;
	
	Если НЕ ПроведениеДокументовКлиентСервер.ПрочитатьЗначение(вхПараметры, "ТаблицаТоваров", ТабТоваров) Тогда
		ТабТоваров = РегистрыНакопления_ТоварыНаСкладах(вхСсылкаНаДокумент, вхОтказ);
	КонецЕсли;
	
	ТабПеремещений = ТабТоваров.Скопировать();
	ТабПеремещений.ЗаполнитьЗначения(ВидДвиженияНакопления.Расход, "ВидДвижения");
	
	Возврат ТабПеремещений;
	
КонецФункции

Функция РегистрыНакопления_РезервыТоваров(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено)
	ТабРезервы = Новый ТаблицаЗначений;
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(вхСсылкаНаДокумент, "Дата") < ПараметрыСеанса.ДатаНачалаРаботыТовары Тогда
		ТаблицаДвижений = Неопределено;
		ОбщегоНазначения.СоздатьСтруктуруРегистраНакопления("РезервыТоваров", ТаблицаДвижений);
		Возврат ТаблицаДвижений
	КонецЕсли;
	
	ОбщегоНазначения.СоздатьСтруктуруРегистраНакопления("РезервыТоваров", ТабРезервы);
	
	//ЗапросРазмещения = Новый Запрос;
	//ЗапросРазмещения.Текст = 
	//"ВЫБРАТЬ
	//|	РазмещенияСтрокЗаявокОбороты.СтрокаЗаявки,
	//|	РазмещенияСтрокЗаявокОбороты.КоличествоОборот КАК Количество
	//|ИЗ
	//|	РегистрНакопления.РазмещенияСтрокЗаявок.Обороты КАК РазмещенияСтрокЗаявокОбороты
	//|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещенияСтрокЗаказов.Обороты(, , , СтрокаПрихода = &СтрокаПрихода) КАК РазмещенияСтрокЗаказовОбороты
	//|	ПО РазмещенияСтрокЗаявокОбороты.СтрокаЗаказа = РазмещенияСтрокЗаказовОбороты.СтрокаЗаказа";
	//
	//ТабТоваров = Новый ТаблицаЗначений;
	//Если НЕ ПроведениеДокументовКлиентСервер.ПрочитатьЗначение(вхПараметры, "ТаблицаТоваров", ТабТоваров) Тогда
	//	ТабТоваров = РегистрыНакопления_ТоварыНаСкладах(вхСсылкаНаДокумент, вхОтказ);
	//КонецЕсли;
	//
	//Для Каждого Товар Из ТабТоваров Цикл
	//	ЗапросРазмещения.УстановитьПараметр("СтрокаПрихода", Товар.СтрокаПрихода);
	//	ИтогТовар = Товар.Количество;
	//	Для Каждого Размещение Из ЗапросРазмещения.Выполнить().Выгрузить() Цикл
	//		Если ИтогТовар <= 0 Тогда Прервать; КонецЕсли;
	//		Если ИтогТовар <= Размещение.Количество Тогда
	//			нс = ТабРезервы.Добавить();
	//			нс.ВидДвижения = Товар.ВидДвижения;
	//			нс.Регистратор = Товар.Регистратор;
	//			нс.Период = Товар.Период;
	//			нс.Склад = товар.Склад;
	//			нс.Номенклатура = Товар.Номенклатура;
	//			нс.Качество = Товар.Качество;
	//			нс.СтрокаЗаявки = Размещение.СтрокаЗаявки;
	//			нс.Количество = Товар.Количество;
	//			Прервать;
	//		Иначе
	//			нс = ТабРезервы.Добавить();
	//			нс.ВидДвижения = Товар.ВидДвижения;
	//			нс.Регистратор = Товар.Регистратор;
	//			нс.Период = Товар.Период;
	//			нс.Склад = товар.Склад;
	//			нс.Номенклатура = Товар.Номенклатура;
	//			нс.Качество = Товар.Качество;
	//			нс.СтрокаЗаявки = Размещение.СтрокаЗаявки;
	//			нс.Количество = Размещение.Количество;
	//			ИтогТовар = ИтогТовар - Размещение.Количество;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЦикла;
	
	Возврат ТабРезервы;
	
КонецФункции
//--------------------------------------------------------
Процедура ВыполнитьПроведение(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено) Экспорт
		
КонецПроцедуры
